import requests
import json

url = "http://localhost:3125/draft"

template = """
<!DOCTYPE html>
<html>
<head>
  <meta charset='UTF-8'>
  <title>{{title}}</title>
  <link href='https://fonts.googleapis.com/css2?family=Alef:wght@400;700&display=swap' rel='stylesheet'>
    <style>
    * {
      margin: 0;
      padding: 0;
      box-sizing: border-box;
    }

    html, body {
      height: 100%;
      font-family: 'Alef', sans-serif;
    }

    body {
      display: flex;
      flex-direction: column;
      min-height: 100vh;
    }

    header {
      position: fixed;
      top: 0;
      left: 0;
      right: 0;
      height: 3cm;
      text-align: center;
      border-bottom: 1px solid #000;
      background-color: white;
      z-index: 1000;
      display: flex;
      justify-content: space-around;
      align-items: center;
      padding: 10px;
    }

    footer {
      position: fixed;
      bottom: 0;
      left: 0;
      right: 0;
      height: 3cm;
      text-align: center;
      border-top: 1px solid #000;
      background-color: white;
      z-index: 1000;
      display: flex;
      justify-content: center;
      align-items: center;
      padding: 10px;
    }

    main {
      flex: 1;
      padding-top: 3cm;  /* Ensures space for the header */
      padding-bottom: 3cm; /* Ensures space for the footer */
      overflow-y: auto;
      padding: 20px;
      background-color: #f5f5f5;
    }

    /* Adjust for printing */
    @media print {
      @page {
        size: A4;
        margin: 0;
      }

      header, footer {
        position: fixed;
      }

      main {
        padding-top: 3cm;
        padding-bottom: 3cm;
      }
    }
  </style>
</head>
<body>
    <header style="display: flex; justify-content: space-around;">
      <img src="data:image/jpg;base64,{{ reshut_icon }}" alt="Authority Logo" />
      <div id="header_text">
      <p>הדו"ח הנ"ל הינו ראשוני בלבד, תוכנו והמידע הכלול אינו מהווה מידע רשמי וסופי ואינו מחייב את רשות העתיקות עד לפרסום הדו"ח המדעי הסופי.</p>
      <p>© כל הזכויות שמורות לרשות העתיקות</p></div>
    </header>
<main>
      <h2>הקדמה</h2>
   <p>
        רשות העתיקות אחראית על עתיקות הארץ ואתריה, במסגרת זו הרשות פועלת לשמור,
        לחשוף, לשמר, לחקור ולפרסם את עתיקות הארץ ואתריה בישראל ומחוצה לה. ברחבי
        מדינת ישראל קיימים כשלושים אלף אתרים המוגדרים כאתרי עתיקות. אתרים אלה
        וממצאיהם מהווים את מורשת התרבות החומרית של ארץ ישראל, ומשרטטים את קורותיה
        ואת תולדות האדם, העמים והממלכות שחיו כאן במהלך מאות ואלפי השנים האחרונות
      </p>
      <p>
        רשות העתיקות מעודדת את אזרחי המדינה לפעול למען השמירה על עתיקות הארץ
        ומניעת כל פגיעה בהם, כיוון שכל פגיעה כזו יש בה משום נזק בלתי הפיך למורשת
        העבר.
      </p>
      <p>
        חוק העתיקות )התשל"ח - 1978 ( וחוק רשות העתיקות )התשמ"ט - 1989 ( מטפלים בכל
        ענייני העתיקות של מדינת ישראל ביבשה ובים, ומכתיבים את הפעולות לשמירה על
        האיזון הראוי בין צרכי הפיתוח של הארץ לבין השמירה על עתיקותיה. במסגרת
        פעולות אלו ביצעה רשות העתיקות סקר. הדוח שלהלן מפרט את הפעולות
        הארכיאולוגיות שבוצעו בשטח במסגרת הפרויקט.
      </p>
         <p>
        רשות העתיקות אחראית על עתיקות הארץ ואתריה, במסגרת זו הרשות פועלת לשמור,
        לחשוף, לשמר, לחקור ולפרסם את עתיקות הארץ ואתריה בישראל ומחוצה לה. ברחבי
        מדינת ישראל קיימים כשלושים אלף אתרים המוגדרים כאתרי עתיקות. אתרים אלה
        וממצאיהם מהווים את מורשת התרבות החומרית של ארץ ישראל, ומשרטטים את קורותיה
        ואת תולדות האדם, העמים והממלכות שחיו כאן במהלך מאות ואלפי השנים האחרונות
      </p>
      <p>
        רשות העתיקות מעודדת את אזרחי המדינה לפעול למען השמירה על עתיקות הארץ
        ומניעת כל פגיעה בהם, כיוון שכל פגיעה כזו יש בה משום נזק בלתי הפיך למורשת
        העבר.
      </p>
      <p>
        חוק העתיקות )התשל"ח - 1978 ( וחוק רשות העתיקות )התשמ"ט - 1989 ( מטפלים בכל
        ענייני העתיקות של מדינת ישראל ביבשה ובים, ומכתיבים את הפעולות לשמירה על
        האיזון הראוי בין צרכי הפיתוח של הארץ לבין השמירה על עתיקותיה. במסגרת
        פעולות אלו ביצעה רשות העתיקות סקר. הדוח שלהלן מפרט את הפעולות
        הארכיאולוגיות שבוצעו בשטח במסגרת הפרויקט.
      </p>   <p>
        רשות העתיקות אחראית על עתיקות הארץ ואתריה, במסגרת זו הרשות פועלת לשמור,
        לחשוף, לשמר, לחקור ולפרסם את עתיקות הארץ ואתריה בישראל ומחוצה לה. ברחבי
        מדינת ישראל קיימים כשלושים אלף אתרים המוגדרים כאתרי עתיקות. אתרים אלה
        וממצאיהם מהווים את מורשת התרבות החומרית של ארץ ישראל, ומשרטטים את קורותיה
        ואת תולדות האדם, העמים והממלכות שחיו כאן במהלך מאות ואלפי השנים האחרונות
      </p>
      <p>
        רשות העתיקות מעודדת את אזרחי המדינה לפעול למען השמירה על עתיקות הארץ
        ומניעת כל פגיעה בהם, כיוון שכל פגיעה כזו יש בה משום נזק בלתי הפיך למורשת
        העבר.
      </p>
      <p>
        חוק העתיקות )התשל"ח - 1978 ( וחוק רשות העתיקות )התשמ"ט - 1989 ( מטפלים בכל
        ענייני העתיקות של מדינת ישראל ביבשה ובים, ומכתיבים את הפעולות לשמירה על
        האיזון הראוי בין צרכי הפיתוח של הארץ לבין השמירה על עתיקותיה. במסגרת
        פעולות אלו ביצעה רשות העתיקות סקר. הדוח שלהלן מפרט את הפעולות
        הארכיאולוגיות שבוצעו בשטח במסגרת הפרויקט.
      </p>   <p>
        רשות העתיקות אחראית על עתיקות הארץ ואתריה, במסגרת זו הרשות פועלת לשמור,
        לחשוף, לשמר, לחקור ולפרסם את עתיקות הארץ ואתריה בישראל ומחוצה לה. ברחבי
        מדינת ישראל קיימים כשלושים אלף אתרים המוגדרים כאתרי עתיקות. אתרים אלה
        וממצאיהם מהווים את מורשת התרבות החומרית של ארץ ישראל, ומשרטטים את קורותיה
       ... ואת תולדות האדם, העמים והממלכות שחיו כאן במהלך מאות ואלפי השנים האחרונות
      </p>
      <p>
        רשות העתיקות מעודדת את אזרחי המדינה לפעול למען השמירה על עתיקות הארץ
        ומניעת כל פגיעה בהם, כיוון שכל פגיעה כזו יש בה משום נזק בלתי הפיך למורשת
        העבר.
      </p>
      <p>
        חוק העתיקות )התשל"ח - 1978 ( וחוק רשות העתיקות )התשמ"ט - 1989 ( מטפלים בכל
        ענייני העתיקות של מדינת ישראל ביבשה ובים, ומכתיבים את הפעולות לשמירה על
        האיזון הראוי בין צרכי הפיתוח של הארץ לבין השמירה על עתיקותיה. במסגרת
        פעולות אלו ביצעה רשות העתיקות סקר. הדוח שלהלן מפרט את הפעולות
        הארכיאולוגיות שבוצעו בשטח במסגרת הפרויקט.
      </p>   <p>
        רשות העתיקות אחראית על עתיקות הארץ ואתריה, במסגרת זו הרשות פועלת לשמור,
        לחשוף, לשמר, לחקור ולפרסם את עתיקות הארץ ואתריה בישראל ומחוצה לה. ברחבי
        מדינת ישראל קיימים כשלושים אלף אתרים המוגדרים כאתרי עתיקות. אתרים אלה
        וממצאיהם מהווים את מורשת התרבות החומרית של ארץ ישראל, ומשרטטים את קורותיה
        .................................................ואת תולדות האדם, העמים והממלכות שחיו כאן במהלך מאות ואלפי השנים האחרונות
      </p>
      <p>.......................
        רשות העתיקות מעודדת את אזרחי המדינה לפעול למען השמירה על עתיקות הארץ
        ומניעת כל פגיעה בהם, כיוון שכל פגיעה כזו יש בה משום נזק בלתי הפיך למורשת
        העבר.
      </p>
      <p>
        חוק העתיקות )התשל"ח - 1978 ( וחוק רשות העתיקות )התשמ"ט - 1989 ( מטפלים בכל
        ענייני העתיקות של מדינת ישראל ביבשה ובים, ומכתיבים את הפעולות לשמירה על
        האיזון הראוי בין צרכי הפיתוח של הארץ לבין השמירה על עתיקותיה. במסגרת
        פעולות אלו ביצעה רשות העתיקות סקר. הדוח שלהלן מפרט את הפעולות
        הארכיאולוגיות שבוצעו בשטח במסגרת הפרויקט.
      </p>   <p>
        רשות העתיקות אחראית על עתיקות הארץ ואתריה, במסגרת זו הרשות פועלת לשמור,
        לחשוף, לשמר, לחקור ולפרסם את עתיקות הארץ ואתריה בישראל ומחוצה לה. ברחבי
        מדינת ישראל קיימים כשלושים אלף אתרים המוגדרים כאתרי עתיקות. אתרים אלה
        וממצאיהם מהווים את מורשת התרבות החומרית של ארץ ישראל, ומשרטטים את קורותיה
        ואת תולדות האדם, העמים והממלכות שחיו כאן במהלך מאות ואלפי השנים האחרונות
      </p>
      <p>
        רשות העתיקות מעודדת את אזרחי המדינה לפעול למען השמירה על עתיקות הארץ
        ומניעת כל פגיעה בהם, כיוון שכל פגיעה כזו יש בה משום נזק בלתי הפיך למורשת
        העבר.
      </p>
      <p>
        חוק העתיקות )התשל"ח - 1978 ( וחוק רשות העתיקות )התשמ"ט - 1989 ( מטפלים בכל
        ענייני העתיקות של מדינת ישראל ביבשה ובים, ומכתיבים את הפעולות לשמירה על
        האיזון הראוי בין צרכי הפיתוח של הארץ לבין השמירה על עתיקותיה. במסגרת
        פעולות אלו ביצעה רשות העתיקות סקר. הדוח שלהלן מפרט את הפעולות
        הארכיאולוגיות שבוצעו בשטח במסגרת הפרויקט.
      </p>

  </main>
    <footer>
    <p>זכויות היוצרים הם של רשות העתיקות. אין לשכפל, להעתיק, לצלם, להקליט, לתרגם,לאחסן במאגר מידע, לסדר או לקלוט בכל דרך ובכל אמצעי אלקטרוני, אופטי או מכני אחר - כל חלק שהוא מחומר זה ללא הסכמת רשות העתיקות</p>
      <p>© כל הזכויות שמורות לרשות העתיקות</p>
    </footer>
  </body>

</html>
"""
payload = json.dumps({
  "template": template,
  "data": {
  "title": "שלום עולם",
  "description": "זהו PDF שמציג טקסט בעברית",
  "items": [
            "פריט 1",
            "פריט 2",
            "פריט 3"
        ],
  "reshut_icon": "<base64 encoded image>", 
  "intro_text": "רשות העתיקות אחראית על עתיקות הארץ ואתריה ...",
  "merchav": "ירושלים",
  "license": "12345",
  "report_name": "דוח חפירות",
  "report_type": "חתכי בדיקה",
  "findings": [
    {
      "number": 1,
      "description": "תיאור הממצא הראשון",
      "element": "אלמנט 1",
      "period": "תקופה 1",
      "depth": "1.5 מ'",
      "x": "30.123",
      "y": "35.678"
    },
    {
      "number": 2,
      "description": "תיאור הממצא השני",
      "element": "אלמנט 2",
      "period": "תקופה 2",
      "depth": "2.0 מ'",
      "x": "30.124",
      "y": "35.679"
    }
  ],
  "recommendation": "ההמלצה כאן",
  "comments": "הערות נוספות",
  "conclusion": "מסקנות הדו\"ח",
  "arch_name": "שדמן עמית",
  "role": "ארכאולוג מרחב",
      }
})

headers = {
    'Content-Type': 'application/json'
}

response = requests.request("POST", url, headers=headers, data=payload)
# Save the PDF file
if response.status_code != 200:
    print("Error!")
    print(response.text)
else:
  with open("output.pdf", "wb") as f:
      f.write(response.content)
  print("PDF file saved as output.pdf")
